; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 422264 2 1 4 8 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image1 - mode
	thermograph0 - mode
	thermograph2 - mode
	infrared3 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation6 - direction
	Star7 - direction
	Star1 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 image1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument1 infrared3)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
)
(:goal (and
	(pointing satellite0 GroundStation2)
	(pointing satellite1 Planet10)
	(have_image Planet8 infrared3)
	(have_image Planet9 image1)
	(have_image Planet10 thermograph0)
	(have_image Phenomenon11 image1)
	(have_image Planet12 thermograph2)
	(have_image Planet13 image1)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
3. (turn_to satellite1 star1 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star1)
   goals met: 0 of 8
4. (turn_to satellite0 star1 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star1)
   goals met: 0 of 8
5. (calibrate satellite1 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 0 of 8
6. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 8
7. (turn_to satellite1 planet10 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet10)
   goals met: 1 of 8
8. (turn_to satellite0 planet8 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet8)
   goals met: 1 of 8
9. (take_image satellite1 planet10 instrument1 thermograph0)
   added: (have_image planet10 thermograph0)
   goals met: 2 of 8
10. (take_image satellite0 planet8 instrument0 infrared3)
   added: (have_image planet8 infrared3)
   goals met: 3 of 8
11. (turn_to satellite0 planet13 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet13)
   goals met: 3 of 8
12. (take_image satellite0 planet13 instrument0 image1)
   added: (have_image planet13 image1)
   goals met: 4 of 8
13. (turn_to satellite0 planet12 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet12)
   goals met: 4 of 8
14. (take_image satellite0 planet12 instrument0 thermograph2)
   added: (have_image planet12 thermograph2)
   goals met: 5 of 8
15. (turn_to satellite0 phenomenon11 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon11)
   goals met: 5 of 8
16. (take_image satellite0 phenomenon11 instrument0 image1)
   added: (have_image phenomenon11 image1)
   goals met: 6 of 8
17. (turn_to satellite0 groundstation2 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 groundstation2)
   goals met: 7 of 8
18. (turn_to satellite0 planet9 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet9)
   goals met: 6 of 8
19. (take_image satellite0 planet9 instrument0 image1)
   added: (have_image planet9 image1)
   goals met: 7 of 8
20. (turn_to satellite0 groundstation2 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation2)
   goals met: 8 of 8
